In [3]:
import pandas as pd
import mysql.connector
import sqlalchemy as sqlac
import numpy as np

# I. MySQL

## A. Manggil semua data

### 1. Pake mysql.connector

In [3]:
dbku = mysql.connector.connect(
    host = "localhost",
    user = "Adyan",
    passwd = "C3ndolbig",
    database = "pandas_tes"
)

In [8]:
query = "select * from employees"
df = pd.read_sql(query, dbku)
df

   id     nama              email               waktu
0   1   Asnawi    asnawi@yahoo.id 2019-12-09 09:30:11
1   2    Bagas  bagasadi@yahoo.id 2019-12-09 09:30:11
2   3     Evan    evandd@yahoo.id 2019-12-09 09:30:11
3   4  Osvaldo   osvaldo@yahoo.id 2019-12-09 09:30:11

### 2. Pake database string URI

Install mysqldb dulu <br>
pip install mysqlclient

In [11]:
query = "select * from employees"
alamatDB = "mysql://Adyan:C3ndolbig@localhost:3306/pandas_tes"
df = pd.read_sql(query, alamatDB)
df

   id     nama              email               waktu
0   1   Asnawi    asnawi@yahoo.id 2019-12-09 09:30:11
1   2    Bagas  bagasadi@yahoo.id 2019-12-09 09:30:11
2   3     Evan    evandd@yahoo.id 2019-12-09 09:30:11
3   4  Osvaldo   osvaldo@yahoo.id 2019-12-09 09:30:11

### 3. Pake SQLAlchemy

#### a. Pake query

In [17]:
engine = sqlac.create_engine('mysql://Adyan:C3ndolbig@localhost:3306/pandas_tes')
query = 'select * from employees'
df = pd.read_sql(query, engine)
df

   id     nama              email               waktu
0   1   Asnawi    asnawi@yahoo.id 2019-12-09 09:30:11
1   2    Bagas  bagasadi@yahoo.id 2019-12-09 09:30:11
2   3     Evan    evandd@yahoo.id 2019-12-09 09:30:11
3   4  Osvaldo   osvaldo@yahoo.id 2019-12-09 09:30:11

#### b. Tanpa query

##### i. Tampilkan semua kolom

In [18]:
engine = sqlac.create_engine('mysql://Adyan:C3ndolbig@localhost:3306/pandas_tes')
df = pd.read_sql('employees', engine)
df

   id     nama              email               waktu
0   1   Asnawi    asnawi@yahoo.id 2019-12-09 09:30:11
1   2    Bagas  bagasadi@yahoo.id 2019-12-09 09:30:11
2   3     Evan    evandd@yahoo.id 2019-12-09 09:30:11
3   4  Osvaldo   osvaldo@yahoo.id 2019-12-09 09:30:11

##### ii. Hanya tampilkan kolom tertentu

In [20]:
engine = sqlac.create_engine('mysql://Adyan:C3ndolbig@localhost:3306/pandas_tes')
df = pd.read_sql('employees', engine, columns=['nama', 'waktu'])
df

      nama               waktu
0   Asnawi 2019-12-09 09:30:11
1    Bagas 2019-12-09 09:30:11
2     Evan 2019-12-09 09:30:11
3  Osvaldo 2019-12-09 09:30:11

## B. Masukkin ke database (SQL)

Note: name harus lowercase

In [21]:
engine = sqlac.create_engine('mysql://Adyan:C3ndolbig@localhost:3306/pandas_tes')
df = pd.read_sql('employees', engine)
df

   id     nama              email               waktu
0   1   Asnawi    asnawi@yahoo.id 2019-12-09 09:30:11
1   2    Bagas  bagasadi@yahoo.id 2019-12-09 09:30:11
2   3     Evan    evandd@yahoo.id 2019-12-09 09:30:11
3   4  Osvaldo   osvaldo@yahoo.id 2019-12-09 09:30:11

### 1. Nulis baru

In [22]:
df.to_sql(
    name = 'daftarkaryawan',
    con = engine
)

### 2. Nambah data

In [23]:
df.to_sql(
    name = 'daftarkaryawan',
    con = engine,
    if_exists = 'append'
)

### 3. Overwrite data

In [24]:
df.to_sql(
    name = 'daftarkaryawan',
    con = engine,
    if_exists = 'replace'
)

## C. Masukkin data waktu ke DataFrame lalu Panggil data berdasarkan waktu

### 1. Teori

#### Step 1: Panggil database normal

In [77]:
engine = sqlac.create_engine('mysql://Adyan:C3ndolbig@localhost:3306/pandas_tes')
df = pd.read_sql('employees', engine, parse_dates = ['waktu'])
df

   id     nama              email               waktu
0   1   Asnawi    asnawi@yahoo.id 2019-12-09 09:30:11
1   2    Bagas  bagasadi@yahoo.id 2019-12-09 09:30:11
2   3     Evan    evandd@yahoo.id 2019-12-09 09:30:11
3   4  Osvaldo   osvaldo@yahoo.id 2019-12-09 09:30:11

#### Step 2: Masukkin data baru yg waktunya terbaca string

In [78]:
newData = pd.DataFrame([
    {'id': 5,
     'nama': 'Saddil',
     'email': 'saddil@gmail.com',
     'waktu': '2019-02-10 10:22:31'}
])
newData.dtypes

id        int64
nama     object
email    object
waktu    object
dtype: object

#### Step 3: Ubah kolom waktu yg string menjadi datetime

In [79]:
newData['waktu'] = newData['waktu'].astype('datetime64')
newData.dtypes

id                int64
nama             object
email            object
waktu    datetime64[ns]
dtype: object

#### Step 4: Gabung di data lama

In [80]:
df = pd.concat([df, newData], ignore_index= True)
df

   id     nama              email               waktu
0   1   Asnawi    asnawi@yahoo.id 2019-12-09 09:30:11
1   2    Bagas  bagasadi@yahoo.id 2019-12-09 09:30:11
2   3     Evan    evandd@yahoo.id 2019-12-09 09:30:11
3   4  Osvaldo   osvaldo@yahoo.id 2019-12-09 09:30:11
4   5   Saddil   saddil@gmail.com 2019-02-10 10:22:31

#### Step 5: Ngeset kolom waktu jadi index

In [81]:
df = df.set_index('waktu')
df

                     id     nama              email
waktu
2019-12-09 09:30:11   1   Asnawi    asnawi@yahoo.id
2019-12-09 09:30:11   2    Bagas  bagasadi@yahoo.id
2019-12-09 09:30:11   3     Evan    evandd@yahoo.id
2019-12-09 09:30:11   4  Osvaldo   osvaldo@yahoo.id
2019-02-10 10:22:31   5   Saddil   saddil@gmail.com

#### Step 6: Bisa manggil data berdasarkan tahun dan atau bulan

In [83]:
df['2019-02']

                     id    nama             email
waktu
2019-02-10 10:22:31   5  Saddil  saddil@gmail.com

### 2. Studi kasus

#### a. Import Data lalu Ubah type data waktunnya jadi datetime lalu jadikan kolom 'Date' jadi index

In [4]:
df = pd.read_csv('TLKM.JK.csv', parse_dates= ['Date'], index_col= 'Date')
df

              Open    High     Low   Close  Adj Close       Volume
Date
2014-12-09  2790.0  2815.0  2780.0  2795.0     2795.0   66592500.0
2014-12-10  2785.0  2840.0  2785.0  2835.0     2835.0   46563600.0
2014-12-11  2805.0  2850.0  2805.0  2835.0     2835.0   95382900.0
2014-12-12  2835.0  2840.0  2815.0  2825.0     2825.0   83571700.0
2014-12-15  2790.0  2815.0  2765.0  2785.0     2785.0   87239500.0
...            ...     ...     ...     ...        ...          ...
2019-12-02  3960.0  3960.0  3930.0  3950.0     3950.0   74263500.0
2019-12-03  3920.0  3940.0  3910.0  3920.0     3920.0   74494000.0
2019-12-04  3920.0  3990.0  3900.0  3990.0     3990.0   64948300.0
2019-12-05  3990.0  4080.0  3990.0  4060.0     4060.0  118494800.0
2019-12-06  4040.0  4100.0  4020.0  4100.0     4100.0   50682100.0

[1264 rows x 6 columns]

#### b. Tampilin data di range waktu tertentu

In [5]:
df['2015-02-10':'2015-02-11']

              Open    High     Low   Close  Adj Close      Volume
Date
2015-02-10  2875.0  2875.0  2835.0  2845.0     2845.0  70239800.0
2015-02-11  2860.0  2870.0  2850.0  2860.0     2860.0  94908700.0

#### c. Nyari harga close tertinggi di Februari 2015

In [6]:
df['2015-02']['Close'].max()

2980.0

#### d. Nyari data yg di hari itu harga closenya tertinggi selama bulan Februari 2015

In [7]:
df[df['Close'] == df['2015-02']['Close'].max()]

              Open    High     Low   Close  Adj Close       Volume
Date
2015-02-13  2915.0  3020.0  2915.0  2980.0     2980.0  183459600.0

#### e. Resample

##### i. Nyari harga rata-rata di akhir bulan

In [8]:
df['2015']['Close'].resample('M').mean()

Date
2015-01-31    2848.333333
2015-02-28    2885.526316
2015-03-31    2920.681818
2015-04-30    2812.380952
2015-05-31    2828.421053
2015-06-30    2868.095238
2015-07-31    2880.263158
2015-08-31    2850.000000
2015-09-30    2717.857143
2015-10-31    2717.857143
2015-11-30    2796.904762
2015-12-31    3036.750000
Freq: M, Name: Close, dtype: float64

##### ii. Nyari harga rata-rata di Weekend

In [9]:
df['2015-02']['Close'].resample('W').mean()

Date
2015-02-08    2824.0
2015-02-15    2888.0
2015-02-22    2892.5
2015-03-01    2939.0
Freq: W-SUN, Name: Close, dtype: float64

##### iii. Nyari harga rata-rata di tiap Quarter

In [10]:
df['2015']['Close'].resample('Q').mean()

Date
2015-03-31    2885.403226
2015-06-30    2836.557377
2015-09-30    2813.333333
2015-12-31    2847.500000
Freq: Q-DEC, Name: Close, dtype: float64

#### h. Menghandle waktu yg hilang

##### Step 1: Memunculkan semua hari (termasuk weekend)

In [11]:
df = df.resample('D').sum()
df

              Open    High     Low   Close  Adj Close       Volume
Date
2014-12-09  2790.0  2815.0  2780.0  2795.0     2795.0   66592500.0
2014-12-10  2785.0  2840.0  2785.0  2835.0     2835.0   46563600.0
2014-12-11  2805.0  2850.0  2805.0  2835.0     2835.0   95382900.0
2014-12-12  2835.0  2840.0  2815.0  2825.0     2825.0   83571700.0
2014-12-13     0.0     0.0     0.0     0.0        0.0          0.0
...            ...     ...     ...     ...        ...          ...
2019-12-02  3960.0  3960.0  3930.0  3950.0     3950.0   74263500.0
2019-12-03  3920.0  3940.0  3910.0  3920.0     3920.0   74494000.0
2019-12-04  3920.0  3990.0  3900.0  3990.0     3990.0   64948300.0
2019-12-05  3990.0  4080.0  3990.0  4060.0     4060.0  118494800.0
2019-12-06  4040.0  4100.0  4020.0  4100.0     4100.0   50682100.0

[1824 rows x 6 columns]

##### Step 2: mereplace yg 0 jadi NaN

In [13]:
df.iloc[:, 0:5] = df.iloc[:, 0:5].replace(0, np.NaN)
df

              Open    High     Low   Close  Adj Close       Volume
Date
2014-12-09  2790.0  2815.0  2780.0  2795.0     2795.0   66592500.0
2014-12-10  2785.0  2840.0  2785.0  2835.0     2835.0   46563600.0
2014-12-11  2805.0  2850.0  2805.0  2835.0     2835.0   95382900.0
2014-12-12  2835.0  2840.0  2815.0  2825.0     2825.0   83571700.0
2014-12-13     NaN     NaN     NaN     NaN        NaN          0.0
...            ...     ...     ...     ...        ...          ...
2019-12-02  3960.0  3960.0  3930.0  3950.0     3950.0   74263500.0
2019-12-03  3920.0  3940.0  3910.0  3920.0     3920.0   74494000.0
2019-12-04  3920.0  3990.0  3900.0  3990.0     3990.0   64948300.0
2019-12-05  3990.0  4080.0  3990.0  4060.0     4060.0  118494800.0
2019-12-06  4040.0  4100.0  4020.0  4100.0     4100.0   50682100.0

[1824 rows x 6 columns]

##### Step 3: Mengisi data kosong dengan data hari sebelumnya

In [14]:
df = df.fillna(method='ffill')
df

              Open    High     Low   Close  Adj Close       Volume
Date
2014-12-09  2790.0  2815.0  2780.0  2795.0     2795.0   66592500.0
2014-12-10  2785.0  2840.0  2785.0  2835.0     2835.0   46563600.0
2014-12-11  2805.0  2850.0  2805.0  2835.0     2835.0   95382900.0
2014-12-12  2835.0  2840.0  2815.0  2825.0     2825.0   83571700.0
2014-12-13  2835.0  2840.0  2815.0  2825.0     2825.0          0.0
...            ...     ...     ...     ...        ...          ...
2019-12-02  3960.0  3960.0  3930.0  3950.0     3950.0   74263500.0
2019-12-03  3920.0  3940.0  3910.0  3920.0     3920.0   74494000.0
2019-12-04  3920.0  3990.0  3900.0  3990.0     3990.0   64948300.0
2019-12-05  3990.0  4080.0  3990.0  4060.0     4060.0  118494800.0
2019-12-06  4040.0  4100.0  4020.0  4100.0     4100.0   50682100.0

[1824 rows x 6 columns]